OpenEVSE/openevse_esp32_firmware/src/LedManagerTask.cpp
#if defined(ENABLE_DEBUG) && !defined(ENABLE_DEBUG_LED)
#undef ENABLE_DEBUG
#endif

#include <Arduino.h>
#include <openevse.h>

#ifdef ESP32
//#include <analogWrite.h>
#if defined(RED_LED) && defined(GREEN_LED) && defined(BLUE_LED)
#ifndef RED_LEDC_CHANNEL
#define RED_LEDC_CHANNEL 1
#endif
#ifndef GREEN_LEDC_CHANNEL
#define GREEN_LEDC_CHANNEL 2
#endif
#ifndef BLUE_LEDC_CHANNEL
#define BLUE_LEDC_CHANNEL 3
#endif
#ifndef LEDC_FREQUENCY
#define LEDC_FREQUENCY 5000
#endif
#ifndef LEDC_RESOLUTION
#define LEDC_RESOLUTION 8
#endif
#endif
#endif

#include "debug.h"
#include "emonesp.h"
#include "LedManagerTask.h"

#if defined(NEO_PIXEL_PIN) && defined(NEO_PIXEL_LENGTH) && !defined(ENABLE_WS2812FX)
#include <Adafruit_NeoPixel.h>
Adafruit_NeoPixel strip = Adafruit_NeoPixel(NEO_PIXEL_LENGTH, NEO_PIXEL_PIN, NEO_GRB + NEO_KHZ800);
#elif defined(NEO_PIXEL_PIN) && defined(NEO_PIXEL_LENGTH) && defined(ENABLE_WS2812FX)
#include <WS2812FX.h>
WS2812FX ws2812fx = WS2812FX(NEO_PIXEL_LENGTH, NEO_PIXEL_PIN, NEO_GRB + NEO_KHZ800);

// True once ws2812fx.init() has run. WS2812FX::setBrightness() calls show(),
// and a show() before init() breaks the strip on core 3: NeoPixel's espShow()
// caches the pin it has RMT-initialised, then init()'s pinMode(OUTPUT) makes
// the Peripheral Manager destroy that RMT channel, and every later show()
// trusts the stale cache, skips re-init and dies silently in rmtWrite().
// config_load_settings() calls setBrightness() before setup() runs, so the
// pre-init forward has to be suppressed (the value is applied in setup()).
static bool neopixels_ready = false;

// Travelling breath: the whole strip holds the EVSE state colour and only the
// brightness moves, each LED a fixed fraction of a cycle behind the one before
// it, so the glow flows along the chain instead of the strip blinking as one.
//
// Registered as a WS2812FX custom mode rather than driven from our own task, so
// it runs inside the existing service() tick and keeps setColor/setSpeed/
// setBrightness working exactly as they do for the stock effects. Returning the
// frame interval is the library's contract for how soon to be called again.
//
// A raised cosine, not a triangle: a linear ramp reads as a mechanical pulse
// because the eye's response is roughly logarithmic, and it visibly "corners" at
// the top and bottom of every cycle. The squaring is a cheap gamma step -- the
// dim end of a WS2812 is where banding shows, and without it the tail of each
// breath stutters between a handful of discrete levels.
#define BREATH_FRAME_MS      20     // 50 fps; below ~30 the ramp starts to step
#define BREATH_FLOOR         24     // never fully dark: a charging EVSE stays visibly lit
// Cycle fraction spanned by the whole strip. This MUST be 1.0 (or a whole
// number); it is not a free aesthetic knob. At any other value the wave
// finishes sweeping the strip part-way through the cycle and the rest is dead
// time before it restarts at LED 0, which reads as a jerk at the wrap. At 1.0
// the last LED's phase runs straight into the first's and the loop is seamless.
#define BREATH_PHASE_SPREAD  1.0f

// Mode index handed back by setCustomMode(); not assumed to be FX_MODE_CUSTOM_0.
static uint8_t breathMode = FX_MODE_STATIC;

static uint16_t ledBreathEffect()
{
  uint32_t period = ws2812fx.getSpeed();
  if(period < 200) {
    period = 200;              // guard: a zero speed would divide by zero below
  }

  uint32_t color = ws2812fx.getColor();
  uint8_t  r = (uint8_t)(color >> 16), g = (uint8_t)(color >> 8), b = (uint8_t)color;
  uint16_t n = ws2812fx.getLength();

  float base = (float)(millis() % period) / (float)period;   // 0..1 through the cycle

  for(uint16_t i = 0; i < n; i++)
  {
    // Each LED sits further round the same cycle, so the peak walks the chain.
    float phase = base - ((float)i * BREATH_PHASE_SPREAD / (float)(n ? n : 1));
    phase -= floorf(phase);

    float wave = 0.5f * (1.0f - cosf(phase * 2.0f * (float)M_PI));   // 0..1, smooth
    wave *= wave;                                                     // gamma
    uint8_t level = BREATH_FLOOR + (uint8_t)((255 - BREATH_FLOOR) * wave);

    ws2812fx.setPixelColor(i, (uint8_t)(r * level / 255),
                              (uint8_t)(g * level / 255),
                              (uint8_t)(b * level / 255));
  }

  return BREATH_FRAME_MS;
}

class LedAnimatorTask : public MicroTasks::Task
{
  public:
    void setup() {
    }
    unsigned long loop(MicroTasks::WakeReason reason) {
      ws2812fx.service();
      return 10;
    }
} animator;
#endif

#define FADE_STEP         16
#define FADE_DELAY        50

#define CONNECTING_FLASH_TIME 450
#define CONNECTED_FLASH_TIME  250

#if defined(ENABLE_WS2812FX)
// Speed for FX Bar Effects
#define DEFAULT_FX_SPEED 1000
#define CONNECTING_FX_SPEED 2000
#define CONNECTED_FX_SPEED  1000
#endif

#define TEST_LED_TIME     500

#if defined(RED_LED) && defined(GREEN_LED) && defined(BLUE_LED)

// https://learn.adafruit.com/led-tricks-gamma-correction/the-quick-fix
const uint8_t gamma8[] = {
  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  1,  1,  1,
  1,  1,  1,  1,  1,  1,  1,  1,  1,  2,  2,  2,  2,  2,  2,  2,
  2,  3,  3,  3,  3,  3,  3,  3,  4,  4,  4,  4,  4,  5,  5,  5,
  5,  6,  6,  6,  6,  7,  7,  7,  7,  8,  8,  8,  9,  9,  9, 10,
 10, 10, 11, 11, 11, 12, 12, 13, 13, 13, 14, 14, 15, 15, 16, 16,
 17, 17, 18, 18, 19, 19, 20, 20, 21, 21, 22, 22, 23, 24, 24, 25,
 25, 26, 27, 27, 28, 29, 29, 30, 31, 32, 32, 33, 34, 35, 35, 36,
 37, 38, 39, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 50,
 51, 52, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 66, 67, 68,
 69, 70, 72, 73, 74, 75, 77, 78, 79, 81, 82, 83, 85, 86, 87, 89,
 90, 92, 93, 95, 96, 98, 99,101,102,104,105,107,109,110,112,114,
115,117,119,120,122,124,126,127,129,131,133,135,137,138,140,142,
144,146,148,150,152,154,156,158,160,162,164,167,169,171,173,175,
177,180,182,184,186,189,191,193,196,198,200,203,205,208,210,213,
215,218,220,223,225,228,231,233,236,239,241,244,247,249,252,255 };

#endif

