OpenEVSE/openevse_esp32_firmware/src/LedManagerTask.cpp
#ifdef WIFI_BUTTON

#if defined(WIFI_LED) && WIFI_LED == WIFI_BUTTON
#define WIFI_BUTTON_SHARE_LED WIFI_LED
#elif defined(RED_LED) && RED_LED == WIFI_BUTTON
#define WIFI_BUTTON_SHARE_LED RED_LED
#define WIFI_BUTTON_SHARE_LEDC_CHANNEL RED_LEDC_CHANNEL
#elif defined(GREEN_LED) && GREEN_LED == WIFI_BUTTON
#define WIFI_BUTTON_SHARE_LED GREEN_LED
#define WIFI_BUTTON_SHARE_LEDC_CHANNEL GREEN_LEDC_CHANNEL
#elif defined(BLUE_LED) && BLUE_LED == WIFI_BUTTON
#define WIFI_BUTTON_SHARE_LED BLUE_LED
#define WIFI_BUTTON_SHARE_LLEDC_CHANNELBLUE_LEDC_CHANNEL
#endif

#endif

#ifdef WIFI_BUTTON_SHARE_LED
uint8_t buttonShareState = 0;
#endif

#if RGB_LED

#define rgb(r,g,b) (r<<16|g<<8|b)

#if defined(NEO_PIXEL_PIN) && defined(NEO_PIXEL_LENGTH) && defined(ENABLE_WS2812FX)

static uint32_t status_colour_map(u_int8_t lcdcol)
{
  u_int32_t color;
  switch (lcdcol)
  {
  case OPENEVSE_LCD_OFF:
    color = 0x000000; // BLACK
    break;
  case OPENEVSE_LCD_RED:
    color = 0xFF0000;  // RED
    break;
  case OPENEVSE_LCD_GREEN:
    color = 0x00FF00; // GREEN
    break;
  case OPENEVSE_LCD_YELLOW:
    color = 0xFFFF00; // YELLOW
    break;
  case OPENEVSE_LCD_BLUE:
    color = 0x0000FF; // BLUE
    break;
  case OPENEVSE_LCD_VIOLET:
    color = 0xFF00FF; // VIOLET
    break;
  case OPENEVSE_LCD_TEAL:
    color = 0x00FFFF; // TEAL
    break;
  case OPENEVSE_LCD_WHITE:
    color = 0xFFFFFF; // WHITE
    break;
  }
  return color; // WHITE
}
#else
static uint32_t status_colour_map[] =
{
  rgb(0, 0, 0),       // OPENEVSE_LCD_OFF
  rgb(255, 0, 0),     // OPENEVSE_LCD_RED
  rgb(0, 255, 0),     // OPENEVSE_LCD_GREEN
  rgb(255, 255, 0),   // OPENEVSE_LCD_YELLOW
  rgb(0, 0, 255),     // OPENEVSE_LCD_BLUE
  rgb(255, 0, 255),   // OPENEVSE_LCD_VIOLET
  rgb(0, 255, 255),   // OPENEVSE_LCD_TEAL
  rgb(255, 255, 255), // OPENEVSE_LCD_WHITE
};
#endif
#endif

LedManagerTask::LedManagerTask() :
  MicroTasks::Task(),
  _evse(nullptr),
  state(LedState_Test_Red),
  wifiClient(false),
  wifiConnected(false),
  flashState(false),
  brightness(LED_DEFAULT_BRIGHTNESS),
  onStateChange(this)
{
}

void LedManagerTask::begin(EvseManager &evse)
{
  _evse = &evse;
  _evse->onStateChange(&onStateChange);
  MicroTask.startTask(this);
}

void LedManagerTask::setup()
{
#if defined(NEO_PIXEL_PIN) && defined(NEO_PIXEL_LENGTH) && !defined(ENABLE_WS2812FX)
  DBUGF("Initialising NeoPixels");
  strip.begin();
  //strip.setBrightness(brightness);
  setAllRGB(0, 0, 0);
#elif defined(NEO_PIXEL_PIN) && defined(NEO_PIXEL_LENGTH) && defined(ENABLE_WS2812FX)
  DEBUG.printf("Initialising NeoPixels WS2812FX MODE...\n");
  ws2812fx.init();
  neopixels_ready = true;
  // apply the brightness stored by any pre-init setBrightness() call, with
  // the same 0 = max mapping it uses
  ws2812fx.setBrightness(0 == brightness ? 255 : brightness - 1);
  ws2812fx.setSpeed(DEFAULT_FX_SPEED);
  ws2812fx.setColor(BLACK);
  breathMode = ws2812fx.setCustomMode(F("Breath"), ledBreathEffect);
  ws2812fx.setMode(FX_MODE_STATIC);
  //ws2812fx.setBrightness(this->brightness);
  DBUGF("Brightness: %d ", this->brightness);
  DBUGF("Brightness: %d ", brightness);

  ws2812fx.start();
  MicroTask.startTask(&animator);
#endif

#if defined(RED_LED) && defined(GREEN_LED) && defined(BLUE_LED)
  DBUGF("Initialising RGB LEDs, %d, %d, %d", RED_LED, GREEN_LED, BLUE_LED);
  // configure LED PWM functionalitites
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3,0,0)
  // core 3.x unified LEDC API: attach pin directly with freq + resolution.
  ledcAttach(RED_LED, LEDC_FREQUENCY, LEDC_RESOLUTION);
  ledcAttach(GREEN_LED, LEDC_FREQUENCY, LEDC_RESOLUTION);
  ledcAttach(BLUE_LED, LEDC_FREQUENCY, LEDC_RESOLUTION);
#else
  ledcSetup(RED_LEDC_CHANNEL, LEDC_FREQUENCY, LEDC_RESOLUTION);
  ledcAttachPin(RED_LED, RED_LEDC_CHANNEL);
  ledcSetup(GREEN_LEDC_CHANNEL, LEDC_FREQUENCY, LEDC_RESOLUTION);
  ledcAttachPin(GREEN_LED, GREEN_LEDC_CHANNEL);
  ledcSetup(BLUE_LEDC_CHANNEL, LEDC_FREQUENCY, LEDC_RESOLUTION);
  ledcAttachPin(BLUE_LED, BLUE_LEDC_CHANNEL);
#endif
#endif

#ifdef WIFI_LED
  DBUGF("Configuring pin %d for LED", WIFI_LED);
  pinMode(WIFI_LED, OUTPUT);
  digitalWrite(WIFI_LED, !WIFI_LED_ON_STATE);
#endif

#if defined(WIFI_BUTTON) && !defined(WIFI_BUTTON_SHARE_LED)
  DBUGF("Configuring pin %d for Button", WIFI_BUTTON);
  pinMode(WIFI_BUTTON, WIFI_BUTTON_PRESSED_PIN_MODE);
#endif
}

unsigned long LedManagerTask::loop(MicroTasks::WakeReason reason)
{
  DBUG("LED manager woke: ");
  DBUG(WakeReason_Scheduled == reason ? "WakeReason_Scheduled" :
       WakeReason_Event == reason ? "WakeReason_Event" :
       WakeReason_Message == reason ? "WakeReason_Message" :
       WakeReason_Manual == reason ? "WakeReason_Manual" :
       "UNKNOWN");
  DBUG(" ");
  DBUGLN(LedState_Off == state ? "LedState_Off" :
         LedState_Test_Red == state ? "LedState_Test_Red" :
         LedState_Test_Green == state ? "LedState_Test_Green" :
         LedState_Test_Blue == state ? "LedState_Test_Blue" :
         LedState_Evse_State == state ? "LedState_Evse_State" :
         LedState_WiFi_Access_Point_Waiting == state ? "LedState_WiFi_Access_Point_Waiting" :
         LedState_WiFi_Access_Point_Connected == state ? "LedState_WiFi_Access_Point_Connected" :
         LedState_WiFi_Client_Connected == state ? "LedState_WiFi_Client_Connected" :
         "UNKNOWN");

  if(onStateChange.IsTriggered()) {
    setNewState(false);
  }

#if RGB_LED
#if defined(NEO_PIXEL_PIN) && defined(NEO_PIXEL_LENGTH) && defined(ENABLE_WS2812FX)
  switch(state)
  {
    case LedState_Off:
      //setAllRGB(0, 0, 0);
      ws2812fx.setColor(BLACK);
      return MicroTask.Infinate;

    case LedState_Test_Red:
      //setAllRGB(255, 0, 0);
      ws2812fx.setColor(RED);
      state = LedState_Test_Green;
      return TEST_LED_TIME;

    case LedState_Test_Green:
      //setAllRGB(0, 255, 0);
      ws2812fx.setColor(GREEN);
      state = LedState_Test_Blue;
      return TEST_LED_TIME;

    case LedState_Test_Blue:
      //setAllRGB(0, 0, 255);
      ws2812fx.setColor(BLUE);
      state = LedState_Off;
      setNewState(false);
      return TEST_LED_TIME;


