OpenEVSE/openevse_esp32_firmware/src/LedManagerTask.cpp
    case LedState_Evse_State:
    case LedState_WiFi_Access_Point_Waiting:
    case LedState_WiFi_Access_Point_Connected:
    case LedState_WiFi_Client_Connecting:
    case LedState_WiFi_Client_Connected:
    {
      uint8_t lcdCol = _evse->getStateColour();
      DBUGVAR(lcdCol);
      uint32_t col = status_colour_map(lcdCol);
      DBUGVAR(col, HEX);
      //DBUGF("Color: %x\n", col);
      bool isCharging, isError;
      u_int16_t speed;
      // Breathe faster the harder it is charging. Deliberately scaled BEFORE
      // dividing: getChargeCurrent()/getMaxHardwareCurrent() is integer
      // division, so it was 0 at every current below the hardware maximum and
      // 1 only at exactly the maximum -- the rate never actually tracked the
      // current, it just sat at 2000 ms. Clamped because a zero period would
      // divide by zero in the effect, and getMaxHardwareCurrent() can read 0
      // before the controller has answered.
      {
        long maxCur = _evse->getMaxHardwareCurrent();
        long frac   = (maxCur > 0) ? ((long)_evse->getChargeCurrent() * 1000 / maxCur) : 0;
        if(frac > 1000) { frac = 1000; }
        speed = (u_int16_t)(2000 - frac);
      }
      DBUGF("Speed: %d ",speed);
      DBUGF("Amps: %d ", _evse->getAmps());
      DBUGF("ChargeCurrent: %d ", _evse->getChargeCurrent());
      DBUGF("MaxHWCurrent: %d ", _evse->getMaxHardwareCurrent());
      if (this->brightness == 0){
        ws2812fx.setBrightness(255);
      }
      else {
        ws2812fx.setBrightness(this->brightness-1);
      }
      switch(state)
      {
        case LedState_Evse_State:
          isCharging = _evse->isCharging();
          isError = _evse->isError();
          if(isCharging){
            // Travelling breath rather than FX_MODE_COLOR_WIPE: the wipe fills
            // the strip and snaps back to the start, and that hard restart is
            // what reads as a blink rather than as charging.
            setAllRGB(col, breathMode, speed);
          } else if(isError){
            setAllRGB(col, FX_MODE_FADE, DEFAULT_FX_SPEED);
          } else {
            setAllRGB(col, FX_MODE_STATIC, DEFAULT_FX_SPEED);
          }    
          //DBUGF("MODE:  LedState_Evse_State\n");
          return MicroTask.Infinate;

        case LedState_WiFi_Access_Point_Waiting:
          setEvseAndWifiRGB(col, FX_MODE_BLINK, CONNECTING_FX_SPEED);
          //DBUGF("MODE: LedState_WiFi_Access_Point_Waiting\n");
          return CONNECTING_FLASH_TIME;

        case LedState_WiFi_Access_Point_Connected:
          setEvseAndWifiRGB(col, FX_MODE_FADE, CONNECTED_FX_SPEED);
          flashState = !flashState;
          //DBUGF("MODE: LedState_WiFi_Access_Point_Connected\n");
          return CONNECTED_FLASH_TIME;

        case LedState_WiFi_Client_Connecting:
          setEvseAndWifiRGB(col, FX_MODE_FADE, CONNECTING_FX_SPEED);
          flashState = !flashState;
          //DBUGF("MODE: LedState_WiFi_Client_Connecting\n");
          return CONNECTING_FLASH_TIME;

        case LedState_WiFi_Client_Connected:
          setEvseAndWifiRGB(col, FX_MODE_FADE, CONNECTED_FX_SPEED);
          //DBUGF("MODOE: LedState_WiFi_Client_Connected\n");
          return MicroTask.Infinate;

        default:
          break;
      }
    }

  }
#else
  switch(state)
  {
    case LedState_Off:
      setAllRGB(0, 0, 0);
      return MicroTask.Infinate;

    case LedState_Test_Red:
      setAllRGB(255, 0, 0);
      state = LedState_Test_Green;
      return TEST_LED_TIME;

    case LedState_Test_Green:
      setAllRGB(0, 255, 0);
      state = LedState_Test_Blue;
      return TEST_LED_TIME;

    case LedState_Test_Blue:
      setAllRGB(0, 0, 255);
      state = LedState_Off;
      setNewState(false);
      return TEST_LED_TIME;

#ifdef WIFI_PIXEL_NUMBER
    case LedState_Evse_State:
    case LedState_WiFi_Access_Point_Waiting:
    case LedState_WiFi_Access_Point_Connected:
    case LedState_WiFi_Client_Connecting:
    case LedState_WiFi_Client_Connected:
    {
      uint8_t lcdCol = _evse->getStateColour();
      DBUGVAR(lcdCol);
      uint32_t col = status_colour_map[lcdCol];
      DBUGVAR(col, HEX);
      uint8_t evseR = (col >> 16) & 0xff;
      uint8_t evseG = (col >> 8) & 0xff;
      uint8_t evseB = col & 0xff;

      switch(state)
      {
        case LedState_Evse_State:
          setAllRGB(evseR, evseG, evseB);
          return MicroTask.Infinate;

        case LedState_WiFi_Access_Point_Waiting:
          setEvseAndWifiRGB(evseR, evseG, evseB, flashState ? 255 : 0, flashState ? 255 : 0, 0);
          flashState = !flashState;
          return CONNECTING_FLASH_TIME;

        case LedState_WiFi_Access_Point_Connected:
          setEvseAndWifiRGB(evseR, evseG, evseB, flashState ? 255 : 0, 0, flashState ? 255 : 0);
          flashState = !flashState;
          return CONNECTED_FLASH_TIME;

        case LedState_WiFi_Client_Connecting:
          setEvseAndWifiRGB(evseR, evseG, evseB, 0, flashState ? 255 : 0, flashState ? 255 : 0);
          flashState = !flashState;
          return CONNECTING_FLASH_TIME;

        case LedState_WiFi_Client_Connected:
          setEvseAndWifiRGB(evseR, evseG, evseB, 0, 255, 0);
          return MicroTask.Infinate;

        default:
          break;
      }
    }
#else
    case LedState_Evse_State:
    {
      uint8_t lcdCol = _evse->getStateColour();
      DBUGVAR(lcdCol);
      uint32_t col = status_colour_map[lcdCol];
      DBUGVAR(col, HEX);
      uint8_t r = (col >> 16) & 0xff;
      uint8_t g = (col >> 8) & 0xff;
      uint8_t b = col & 0xff;
      setAllRGB(r, g, b);
    } return MicroTask.Infinate;

    case LedState_WiFi_Access_Point_Waiting:
      setAllRGB(flashState ? 255 : 0, flashState ? 255 : 0, 0);
      flashState = !flashState;
      return CONNECTING_FLASH_TIME;

    case LedState_WiFi_Access_Point_Connected:
      setAllRGB(flashState ? 255 : 0, 0, flashState ? 255 : 0);
      flashState = !flashState;
      return CONNECTED_FLASH_TIME;

    case LedState_WiFi_Client_Connecting:
      setAllRGB(0, flashState ? 255 : 0, flashState ? 255 : 0);
      flashState = !flashState;
      return CONNECTING_FLASH_TIME;

    case LedState_WiFi_Client_Connected:
      setAllRGB(0, 255, 0);
      return MicroTask.Infinate;
#endif
  }
#endif
#endif

#ifdef WIFI_LED
  switch(state)
  {
    case LedState_Test_Red:
    case LedState_Test_Green:
    case LedState_Test_Blue:
      setWiFiLed(WIFI_LED_ON_STATE);
      state = LedState_Off;
      setNewState(false);
      return TEST_LED_TIME;

    case LedState_Off:
      setWiFiLed(!WIFI_LED_ON_STATE);
      return MicroTask.Infinate;

