OpenEVSE/openevse_esp32_firmware/src/LedManagerTask.cpp
    case LedState_WiFi_Access_Point_Waiting:
      setWiFiLed(flashState ? WIFI_LED_ON_STATE : !WIFI_LED_ON_STATE);
      flashState = !flashState;
      return CONNECTING_FLASH_TIME;

    case LedState_WiFi_Access_Point_Connected:
      setWiFiLed(flashState ? WIFI_LED_ON_STATE : !WIFI_LED_ON_STATE);
      flashState = !flashState;
      return CONNECTED_FLASH_TIME;

    case LedState_WiFi_Client_Connecting:
      setWiFiLed(flashState ? WIFI_LED_ON_STATE : !WIFI_LED_ON_STATE);
      flashState = !flashState;
      return CONNECTING_FLASH_TIME;

    case LedState_WiFi_Client_Connected:
      setWiFiLed(WIFI_LED_ON_STATE);
      return MicroTask.Infinate;

    default:
      break;
  }
#endif

  return MicroTask.Infinate;
}

/*
int LedManagerTask::fadeLed(int fadeValue, int FadeDir)
{
  fadeValue += FadeDir;
  if(fadeValue >= MAX_BM_FADE_LED)
  {
    fadeValue = MAX_BM_FADE_LED;
    FadeDir = -FADE_STEP;
  } else if(fadeValue <= 0) {
    fadeValue = 0;
    FadeDir = FADE_STEP;
  }
  return fadeValue;
}
*/

#if RGB_LED
#if defined(NEO_PIXEL_PIN) && defined(NEO_PIXEL_LENGTH) && defined(ENABLE_WS2812FX)
void LedManagerTask::setAllRGB(uint32_t color, u_int8_t mode, uint16_t speed)
{
  setEvseAndWifiRGB(color, mode, speed);
}


void LedManagerTask::setEvseAndWifiRGB(uint32_t evseColor, u_int8_t mode, u_int16_t speed)
{
  DBUG("EVSE LED COLOR:");
  DBUG(evseColor);
  if(evseColor != ws2812fx.getColor()){
    ws2812fx.setColor(evseColor);
  }

  if(speed != ws2812fx.getSpeed()){
    ws2812fx.setSpeed(speed);
  }

  if (ws2812fx.getMode() != mode){
    ws2812fx.setMode(mode);
  }

}
#else
void LedManagerTask::setAllRGB(uint8_t red, uint8_t green, uint8_t blue)
{
  setEvseAndWifiRGB(red, green, blue, red, green, blue);
}
#endif
#endif

#if WIFI_PIXEL_NUMBER && !defined(ENABLE_WS2812FX)
void LedManagerTask::setEvseAndWifiRGB(uint8_t evseRed, uint8_t evseGreen, uint8_t evseBlue, uint8_t wifiRed, uint8_t wifiGreen, uint8_t wifiBlue)
{
  DBUG("EVSE LED R:");
  DBUG(evseRed);
  DBUG(" G:");
  DBUG(evseGreen);
  DBUG(" B:");
  DBUGLN(evseBlue);

  DBUG("WiFi LED R:");
  DBUG(wifiRed);
  DBUG(" G:");
  DBUG(wifiGreen);
  DBUG(" B:");
  DBUGLN(wifiBlue);

  if(brightness) { // See notes in setBrightness()
    evseRed = (evseRed * brightness) >> 8;
    evseGreen = (evseGreen * brightness) >> 8;
    evseBlue = (evseBlue * brightness) >> 8;
    wifiRed = (wifiRed * brightness) >> 8;
    wifiGreen = (wifiGreen * brightness) >> 8;
    wifiBlue = (wifiBlue * brightness) >> 8;
  }

  DBUG("EVSE LED R:");
  DBUG(evseRed);
  DBUG(" G:");
  DBUG(evseGreen);
  DBUG(" B:");
  DBUGLN(evseBlue);

  DBUG("WiFi LED R:");
  DBUG(wifiRed);
  DBUG(" G:");
  DBUG(wifiGreen);
  DBUG(" B:");
  DBUGLN(wifiBlue);

#if defined(NEO_PIXEL_PIN) && defined(NEO_PIXEL_LENGTH) && !defined(ENABLE_WS2812FX)
  uint32_t col = strip.gamma32(strip.Color(evseRed, evseGreen, evseBlue));
  DBUGVAR(col, HEX);
  strip.fill(col);
  strip.setPixelColor(WIFI_PIXEL_NUMBER, wifiRed, wifiGreen, wifiBlue);
  strip.show();
#endif

#if defined(RED_LED) && defined(GREEN_LED) && defined(BLUE_LED)

  DBUGVAR(gamma8[wifiRed]);
  DBUGVAR(gamma8[wifiGreen]);
  DBUGVAR(gamma8[wifiBlue]);

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3,0,0)
  ledcWrite(RED_LED, gamma8[wifiRed]);
  ledcWrite(GREEN_LED, gamma8[wifiGreen]);
  ledcWrite(BLUE_LED, gamma8[wifiBlue]);
#else
  ledcWrite(RED_LEDC_CHANNEL, gamma8[wifiRed]);
  ledcWrite(GREEN_LEDC_CHANNEL, gamma8[wifiGreen]);
  ledcWrite(BLUE_LEDC_CHANNEL, gamma8[wifiBlue]);
#endif

#ifdef WIFI_BUTTON_SHARE_LED
  #if RED_LED == WIFI_BUTTON_SHARE_LED
    buttonShareState = gamma8[wifiRed];
  #elif GREEN_LED == WIFI_BUTTON_SHARE_LED
    buttonShareState = gamma8[wifiGreen];
  #elif BLUE_LED == WIFI_BUTTON_SHARE_LED
    buttonShareState = gamma8[wifiBlue];
  #endif
  DBUGVAR(buttonShareState);
#endif
#endif
}
#endif

#ifdef WIFI_LED
void LedManagerTask::setWiFiLed(uint8_t state)
{
  DBUGVAR(state);
  digitalWrite(WIFI_LED, state);  // Stored brightness value is different than what's passed.
  // This simplifies the actual scaling math later, allowing a fast
  // 8x8-bit multiply and taking the MSB. 'brightness' is a uint8_t,
  // adding 1 here may (intentionally) roll over...so 0 = max brightness
  // (color values are interpreted ltimingiterally; no scaling), 1 = min
  // brightness (off), 255 = just below max brightness.

#ifdef WIFI_BUTTON_SHARE_LED
  buttonShareState = state ? 0 : 255;
#endif
}
#endif

int LedManagerTask::getPriority(LedState priorityState)
{
  switch (priorityState)
  {
    case LedState_Off:
      return 0;

    case LedState_WiFi_Client_Connected:
      return 10;

    case LedState_Evse_State:
      return _evse->isError() ? 1000 : 50;

    case LedState_WiFi_Access_Point_Waiting:
    case LedState_WiFi_Access_Point_Connected:
    case LedState_WiFi_Client_Connecting:
      return 100;

    case LedState_Test_Red:
    case LedState_Test_Green:
    case LedState_Test_Blue:
      return 2000;
  }

  return 0;
}

void LedManagerTask::setNewState(bool wake)
{
  LedState newState = state < LedState_Off ? state : LedState_Off;
  int priority = getPriority(newState);

  int evsePriority = getPriority(LedState_Evse_State);
  DBUGVAR(evsePriority);
  if(evsePriority > priority) {
    newState = LedState_Evse_State;
    priority = evsePriority;
  }

  LedState wifiState = wifiClient ?
    (wifiConnected ? LedState_WiFi_Client_Connected : LedState_WiFi_Client_Connecting) :
    (wifiConnected ? LedState_WiFi_Access_Point_Connected : LedState_WiFi_Access_Point_Waiting);
  int wifiPriority = getPriority(wifiState);
  if(wifiPriority > priority) {
    newState = wifiState;
    priority = wifiPriority;
  }

  if(newState != state)
  {
    state = newState;
    if(wake) {
      MicroTask.wakeTask(this);
    }
  }
}

void LedManagerTask::clear()
{
  state = LedState_Off;
  MicroTask.wakeTask(this);
}

void LedManagerTask::test()
{
  state = LedState_Test_Red;
  MicroTask.wakeTask(this);
}

void LedManagerTask::setWifiMode(bool client, bool connected)
{
  DBUGF("WiFi mode %d %d", client, connected);
  wifiClient = client;
  wifiConnected = connected;
  setNewState();
}

int LedManagerTask::getButtonPressed()
{
#if defined(WIFI_BUTTON_SHARE_LED)
  #ifdef RGB_LEDC_CHANNEL
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3,0,0)
  ledcDetach(WIFI_BUTTON_SHARE_LED);
  #else
  ledcDetachPin(WIFI_BUTTON_SHARE_LED);
  #endif
  #else
  digitalWrite(WIFI_BUTTON_SHARE_LED, HIGH);
  #endif

  pinMode(WIFI_BUTTON_SHARE_LED, WIFI_BUTTON_PRESSED_PIN_MODE);
#endif

  // Pressing the boot button for 5 seconds will turn on AP mode, 10 seconds will factory reset
  int button = digitalRead(WIFI_BUTTON);

#if defined(WIFI_BUTTON_SHARE_LED)
  #ifdef WIFI_BUTTON_SHARE_LEDC_CHANNEL
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3,0,0)
  ledcAttach(WIFI_BUTTON_SHARE_LED, LEDC_FREQUENCY, LEDC_RESOLUTION);
  #else
  ledcAttachPin(WIFI_BUTTON_SHARE_LED, WIFI_BUTTON_SHARE_LEDC_CHANNEL);
  #endif
  ledcWrite(WIFI_BUTTON_SHARE_LED, buttonShareState);
  #else
  pinMode(WIFI_BUTTON_SHARE_LED, OUTPUT);
  digitalWrite(WIFI_BUTTON_SHARE_LED, buttonShareState ? HIGH : LOW);
  #endif
#endif

  return button;
}

void LedManagerTask::setBrightness(uint8_t brightness)
{
  // Stored brightness value is different than what's passed.
  // This simplifies the actual scaling math later, allowing a fast
  // 8x8-bit multiply and taking the MSB. 'brightness' is a uint8_t,
  // adding 1 here may (intentionally) roll over...so 0 = max brightness
  // (color values are interpreted ltimingiterally; no scaling), 1 = min
  // brightness (off), 255 = just below max brightness.
  this->brightness = brightness + 1;

#if defined(NEO_PIXEL_PIN) && defined(NEO_PIXEL_LENGTH) && defined(ENABLE_WS2812FX)
// This controls changes on the limits of the web interface slidebar.
// Otherwise it gets out of sync
  if(neopixels_ready)
  {
    if (this->brightness == 0){
      ws2812fx.setBrightness(255);
    }
    else {
      ws2812fx.setBrightness(this->brightness-1);
    }
  }
#endif

  DBUGVAR(this->brightness);

  // Wake the task to refresh the state
  MicroTask.wakeTask(this);
}


LedManagerTask ledManager;